; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f40-c16-s4-i16-g4-r2044-020-120-220-320
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12 h13 h14 h15 h16 h17 h18 h19 h20
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12 s13 s14 s15 s16 s17 s18 s19 s20
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 d14 d15 d16 d17 d18 d19 d20
 - card
          celln0 celln1 celln2 celln3 celln4 celln5 celln6 celln7 celln8 celln9 celln10 celln11 celln12 celln13 celln14 celln15 celln16 celln17 celln18 celln19 celln20 celln21 celln22 celln23 celln24 celln25 celln26 celln27 celln28 celln29 celln30 celln31 celln32 celln33 celln34 celln35 celln36 celln37 celln38 celln39 celln40 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 coln10 coln11 coln12 coln13 coln14 coln15 coln16 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 n19 n20 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value c13 n13)
(value c14 n14)
(value c15 n15)
(value c16 n16)
(value c17 n17)
(value c18 n18)
(value c19 n19)
(value c20 n20)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value h13 n13)
(value h14 n14)
(value h15 n15)
(value h16 n16)
(value h17 n17)
(value h18 n18)
(value h19 n19)
(value h20 n20)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value s13 n13)
(value s14 n14)
(value s15 n15)
(value s16 n16)
(value s17 n17)
(value s18 n18)
(value s19 n19)
(value s20 n20)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(value d13 n13)
(value d14 n14)
(value d15 n15)
(value d16 n16)
(value d17 n17)
(value d18 n18)
(value d19 n19)
(value d20 n20)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(cellsuccessor celln5 celln4)
(cellsuccessor celln6 celln5)
(cellsuccessor celln7 celln6)
(cellsuccessor celln8 celln7)
(cellsuccessor celln9 celln8)
(cellsuccessor celln10 celln9)
(cellsuccessor celln11 celln10)
(cellsuccessor celln12 celln11)
(cellsuccessor celln13 celln12)
(cellsuccessor celln14 celln13)
(cellsuccessor celln15 celln14)
(cellsuccessor celln16 celln15)
(cellsuccessor celln17 celln16)
(cellsuccessor celln18 celln17)
(cellsuccessor celln19 celln18)
(cellsuccessor celln20 celln19)
(cellsuccessor celln21 celln20)
(cellsuccessor celln22 celln21)
(cellsuccessor celln23 celln22)
(cellsuccessor celln24 celln23)
(cellsuccessor celln25 celln24)
(cellsuccessor celln26 celln25)
(cellsuccessor celln27 celln26)
(cellsuccessor celln28 celln27)
(cellsuccessor celln29 celln28)
(cellsuccessor celln30 celln29)
(cellsuccessor celln31 celln30)
(cellsuccessor celln32 celln31)
(cellsuccessor celln33 celln32)
(cellsuccessor celln34 celln33)
(cellsuccessor celln35 celln34)
(cellsuccessor celln36 celln35)
(cellsuccessor celln37 celln36)
(cellsuccessor celln38 celln37)
(cellsuccessor celln39 celln38)
(cellsuccessor celln40 celln39)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(colsuccessor coln10 coln9)
(colsuccessor coln11 coln10)
(colsuccessor coln12 coln11)
(colsuccessor coln13 coln12)
(colsuccessor coln14 coln13)
(colsuccessor coln15 coln14)
(colsuccessor coln16 coln15)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(successor n13 n12)
(successor n14 n13)
(successor n15 n14)
(successor n16 n15)
(successor n17 n16)
(successor n18 n17)
(successor n19 n18)
(successor n20 n19)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit c13 c)
(hassuit c14 c)
(hassuit c15 c)
(hassuit c16 c)
(hassuit c17 c)
(hassuit c18 c)
(hassuit c19 c)
(hassuit c20 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit h13 h)
(hassuit h14 h)
(hassuit h15 h)
(hassuit h16 h)
(hassuit h17 h)
(hassuit h18 h)
(hassuit h19 h)
(hassuit h20 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit s13 s)
(hassuit s14 s)
(hassuit s15 s)
(hassuit s16 s)
(hassuit s17 s)
(hassuit s18 s)
(hassuit s19 s)
(hassuit s20 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(hassuit d13 d)
(hassuit d14 d)
(hassuit d15 d)
(hassuit d16 d)
(hassuit d17 d)
(hassuit d18 d)
(hassuit d19 d)
(hassuit d20 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack c12 h13)
(canstack c12 d13)
(canstack c13 h14)
(canstack c13 d14)
(canstack c14 h15)
(canstack c14 d15)
(canstack c15 h16)
(canstack c15 d16)
(canstack c16 h17)
(canstack c16 d17)
(canstack c17 h18)
(canstack c17 d18)
(canstack c18 h19)
(canstack c18 d19)
(canstack c19 h20)
(canstack c19 d20)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack h12 c13)
(canstack h12 s13)
(canstack h13 c14)
(canstack h13 s14)
(canstack h14 c15)
(canstack h14 s15)
(canstack h15 c16)
(canstack h15 s16)
(canstack h16 c17)
(canstack h16 s17)
(canstack h17 c18)
(canstack h17 s18)
(canstack h18 c19)
(canstack h18 s19)
(canstack h19 c20)
(canstack h19 s20)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack s12 h13)
(canstack s12 d13)
(canstack s13 h14)
(canstack s13 d14)
(canstack s14 h15)
(canstack s14 d15)
(canstack s15 h16)
(canstack s15 d16)
(canstack s16 h17)
(canstack s16 d17)
(canstack s17 h18)
(canstack s17 d18)
(canstack s18 h19)
(canstack s18 d19)
(canstack s19 h20)
(canstack s19 d20)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(canstack d12 c13)
(canstack d12 s13)
(canstack d13 c14)
(canstack d13 s14)
(canstack d14 c15)
(canstack d14 s15)
(canstack d15 c16)
(canstack d15 s16)
(canstack d16 c17)
(canstack d16 s17)
(canstack d17 c18)
(canstack d17 s18)
(canstack d18 c19)
(canstack d18 s19)
(canstack d19 c20)
(canstack d19 s20)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln40)
(colspace coln0)

(bottomcol c12)
(on c8 c12)
(on h6 c8)
(on s17 h6)
(clear s17)

(bottomcol s13)
(on d16 s13)
(on s2 d16)
(on s20 s2)
(on h20 s20)
(on d8 h20)
(on d18 d8)
(clear d18)

(bottomcol c3)
(clear c3)

(bottomcol s1)
(on c10 s1)
(on c19 c10)
(on d1 c19)
(on c15 d1)
(on c2 c15)
(on d6 c2)
(clear d6)

(bottomcol h15)
(on c17 h15)
(on s19 c17)
(on h5 s19)
(on s16 h5)
(on s10 s16)
(clear s10)

(bottomcol c18)
(on h3 c18)
(on h14 h3)
(clear h14)

(bottomcol d14)
(on h19 d14)
(on s18 h19)
(on h7 s18)
(on s14 h7)
(on h9 s14)
(on d19 h9)
(on c1 d19)
(on c9 c1)
(clear c9)

(bottomcol d9)
(on h1 d9)
(on c6 h1)
(on c20 c6)
(clear c20)

(bottomcol h13)
(on s6 h13)
(clear s6)

(bottomcol c16)
(on d2 c16)
(on d20 d2)
(on h8 d20)
(on h4 h8)
(on d4 h4)
(clear d4)

(bottomcol c11)
(on d12 c11)
(on s15 d12)
(on h17 s15)
(clear h17)

(bottomcol c5)
(on h12 c5)
(clear h12)

(bottomcol h18)
(on h11 h18)
(on h2 h11)
(on d11 h2)
(on h10 d11)
(on d13 h10)
(on d5 d13)
(clear d5)

(bottomcol d15)
(on h16 d15)
(on c7 h16)
(on c13 c7)
(on c4 c13)
(on s11 c4)
(on s3 s11)
(clear s3)

(bottomcol s5)
(on d10 s5)
(on s12 d10)
(clear s12)

(bottomcol d17)
(on c14 d17)
(on s4 c14)
(on s7 s4)
(on s9 s7)
(on s8 s9)
(on d7 s8)
(on d3 d7)
(clear d3)
)
(:goal
(and
(home c4)
(home h4)
(home s4)
(home d4)
)
)
)

; plan
1. (sendtofree c9 c1 celln40 celln39)
   deleted: (on c9 c1) (clear c9) (cellspace celln40)
   added: (incell c9) (clear c1) (cellspace celln39)
   goals met: 0 of 4
2. (sendtohome c1 d19 c n1 c0 n0)
   deleted: (on c1 d19) (home c0) (clear c1)
   added: (home c1) (clear d19)
   goals met: 0 of 4
3. (sendtofree c20 c6 celln39 celln38)
   deleted: (on c20 c6) (clear c20) (cellspace celln39)
   added: (incell c20) (clear c6) (cellspace celln38)
   goals met: 0 of 4
4. (sendtofree c6 h1 celln38 celln37)
   deleted: (on c6 h1) (clear c6) (cellspace celln38)
   added: (incell c6) (clear h1) (cellspace celln37)
   goals met: 0 of 4
5. (sendtohome h1 d9 h n1 h0 n0)
   deleted: (on h1 d9) (home h0) (clear h1)
   added: (home h1) (clear d9)
   goals met: 0 of 4
6. (sendtofree d6 c2 celln37 celln36)
   deleted: (on d6 c2) (clear d6) (cellspace celln37)
   added: (incell d6) (clear c2) (cellspace celln36)
   goals met: 0 of 4
7. (sendtohome c2 c15 c n2 c1 n1)
   deleted: (on c2 c15) (home c1) (clear c2)
   added: (home c2) (clear c15)
   goals met: 0 of 4
8. (sendtofree c15 d1 celln36 celln35)
   deleted: (on c15 d1) (clear c15) (cellspace celln36)
   added: (incell c15) (clear d1) (cellspace celln35)
   goals met: 0 of 4
9. (sendtohome d1 c19 d n1 d0 n0)
   deleted: (on d1 c19) (home d0) (clear d1)
   added: (home d1) (clear c19)
   goals met: 0 of 4
10. (sendtohome-b c3 c n3 c2 n2 coln0 coln1)
   deleted: (home c2) (clear c3) (bottomcol c3) (colspace coln0)
   added: (home c3) (colspace coln1)
   goals met: 0 of 4
11. (sendtofree d3 d7 celln35 celln34)
   deleted: (on d3 d7) (clear d3) (cellspace celln35)
   added: (incell d3) (clear d7) (cellspace celln34)
   goals met: 0 of 4
12. (sendtofree c19 c10 celln34 celln33)
   deleted: (on c19 c10) (clear c19) (cellspace celln34)
   added: (incell c19) (clear c10) (cellspace celln33)
   goals met: 0 of 4
13. (sendtofree c10 s1 celln33 celln32)
   deleted: (on c10 s1) (clear c10) (cellspace celln33)
   added: (incell c10) (clear s1) (cellspace celln32)
   goals met: 0 of 4
14. (sendtohome-b s1 s n1 s0 n0 coln1 coln2)
   deleted: (home s0) (clear s1) (bottomcol s1) (colspace coln1)
   added: (home s1) (colspace coln2)
   goals met: 0 of 4
15. (sendtofree d18 d8 celln32 celln31)
   deleted: (on d18 d8) (clear d18) (cellspace celln32)
   added: (incell d18) (clear d8) (cellspace celln31)
   goals met: 0 of 4
16. (sendtofree d8 h20 celln31 celln30)
   deleted: (on d8 h20) (clear d8) (cellspace celln31)
   added: (incell d8) (clear h20) (cellspace celln30)
   goals met: 0 of 4
17. (sendtofree h20 s20 celln30 celln29)
   deleted: (on h20 s20) (clear h20) (cellspace celln30)
   added: (incell h20) (clear s20) (cellspace celln29)
   goals met: 0 of 4
18. (sendtofree s20 s2 celln29 celln28)
   deleted: (on s20 s2) (clear s20) (cellspace celln29)
   added: (incell s20) (clear s2) (cellspace celln28)
   goals met: 0 of 4
19. (sendtohome s2 d16 s n2 s1 n1)
   deleted: (on s2 d16) (home s1) (clear s2)
   added: (home s2) (clear d16)
   goals met: 0 of 4
20. (sendtohome s3 s11 s n3 s2 n2)
   deleted: (on s3 s11) (home s2) (clear s3)
   added: (home s3) (clear s11)
   goals met: 0 of 4
21. (sendtofree h14 h3 celln28 celln27)
   deleted: (on h14 h3) (clear h14) (cellspace celln28)
   added: (incell h14) (clear h3) (cellspace celln27)
   goals met: 0 of 4
22. (move d5 d13 s6)
   deleted: (on d5 d13) (clear s6)
   added: (on d5 s6) (clear d13)
   goals met: 0 of 4
23. (sendtofree d13 h10 celln27 celln26)
   deleted: (on d13 h10) (clear d13) (cellspace celln27)
   added: (incell d13) (clear h10) (cellspace celln26)
   goals met: 0 of 4
24. (sendtofree s11 c4 celln26 celln25)
   deleted: (on s11 c4) (clear s11) (cellspace celln26)
   added: (incell s11) (clear c4) (cellspace celln25)
   goals met: 0 of 4
25. (sendtohome c4 c13 c n4 c3 n3)
   deleted: (on c4 c13) (home c3) (clear c4)
   added: (home c4) (clear c13)
   goals met: 1 of 4
26. (sendtofree h10 d11 celln25 celln24)
   deleted: (on h10 d11) (clear h10) (cellspace celln25)
   added: (incell h10) (clear d11) (cellspace celln24)
   goals met: 1 of 4
27. (move d11 h2 s12)
   deleted: (on d11 h2) (clear s12)
   added: (on d11 s12) (clear h2)
   goals met: 1 of 4
28. (sendtohome h2 h11 h n2 h1 n1)
   deleted: (on h2 h11) (home h1) (clear h2)
   added: (home h2) (clear h11)
   goals met: 1 of 4
29. (sendtohome h3 c18 h n3 h2 n2)
   deleted: (on h3 c18) (home h2) (clear h3)
   added: (home h3) (clear c18)
   goals met: 1 of 4
30. (sendtofree d7 s8 celln24 celln23)
   deleted: (on d7 s8) (clear d7) (cellspace celln24)
   added: (incell d7) (clear s8) (cellspace celln23)
   goals met: 1 of 4
31. (sendtofree s8 s9 celln23 celln22)
   deleted: (on s8 s9) (clear s8) (cellspace celln23)
   added: (incell s8) (clear s9) (cellspace celln22)
   goals met: 1 of 4
32. (sendtofree s9 s7 celln22 celln21)
   deleted: (on s9 s7) (clear s9) (cellspace celln22)
   added: (incell s9) (clear s7) (cellspace celln21)
   goals met: 1 of 4
33. (sendtofree s7 s4 celln21 celln20)
   deleted: (on s7 s4) (clear s7) (cellspace celln21)
   added: (incell s7) (clear s4) (cellspace celln20)
   goals met: 1 of 4
34. (sendtohome s4 c14 s n4 s3 n3)
   deleted: (on s4 c14) (home s3) (clear s4)
   added: (home s4) (clear c14)
   goals met: 2 of 4
35. (sendtofree d4 h4 celln20 celln19)
   deleted: (on d4 h4) (clear d4) (cellspace celln20)
   added: (incell d4) (clear h4) (cellspace celln19)
   goals met: 2 of 4
36. (sendtohome h4 h8 h n4 h3 n3)
   deleted: (on h4 h8) (home h3) (clear h4)
   added: (home h4) (clear h8)
   goals met: 3 of 4
37. (sendtofree h8 d20 celln19 celln18)
   deleted: (on h8 d20) (clear h8) (cellspace celln19)
   added: (incell h8) (clear d20) (cellspace celln18)
   goals met: 3 of 4
38. (sendtofree d20 d2 celln18 celln17)
   deleted: (on d20 d2) (clear d20) (cellspace celln18)
   added: (incell d20) (clear d2) (cellspace celln17)
   goals met: 3 of 4
39. (sendtohome d2 c16 d n2 d1 n1)
   deleted: (on d2 c16) (home d1) (clear d2)
   added: (home d2) (clear c16)
   goals met: 3 of 4
40. (homefromfreecell d3 d n3 d2 n2 celln17 celln18)
   deleted: (incell d3) (cellspace celln17) (home d2)
   added: (home d3) (cellspace celln18)
   goals met: 3 of 4
41. (homefromfreecell d4 d n4 d3 n3 celln18 celln19)
   deleted: (incell d4) (cellspace celln18) (home d3)
   added: (home d4) (cellspace celln19)
   goals met: 4 of 4
